[
  {
    "path": "posts/2021-02-28-visual-analytics-project/",
    "title": "Project Proposal",
    "description": "Investing 101: A visual and predictive guide for the rookie investor",
    "author": [
      {
        "name": "Andre Lee | Boey Yi Heen | Ng Weekien",
        "url": {}
      }
    ],
    "date": "2021-02-28",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Overview\r\n2.0 Motivation and Objectives\r\n3.0 Scope\r\n4.0 Data\r\n5.0 Application Features\r\n5.1 Exploratory Data Analysis (EDA)\r\n5.2 Time-Series Forecasting\r\n5.3 Time-Series Clustering\r\n\r\n6.0 Tools and Packages\r\n7.0 References\r\n\r\n1.0 Overview\r\nWith the Federal Reserve once again cutting interest rates to zero and embarking on massive quantitative easing measures in response to the economic malaise brought about by COVID-19, retail investors are becoming increasingly aware that leaving their hard-earned money in the bank is financially imprudent.\r\nHowever, it may seem daunting for first-time investors looking to enter the market, with so many finance websites offering different resources and opinions. Our application looks to guide the beginner investor in their journey to begin investing by zeroing in on a select few stocks, commodities and bonds.\r\n2.0 Motivation and Objectives\r\nExisting financial data websites such as Yahoo Finance do a good job in providing historical price data and technical indicators, but the beginner investor lacks the knowledge to properly utilise and benefit from these. For example, there is a whole plethora of technical indicators available for use, but whether the investor is able to truly understand and use them properly is questionable. We have also identified a gap in such websites, that they do not provide any form of forecasting or cross-asset analysis to aid in investors’ decisions. In addition, it may be informative for an investor to see how macro events on a global scale may affect assets.\r\nThis project aims to utilise various R packages, mainly tidyverse, TTR and dtwcluster in building an interactive R Shiny application. The R Shiny application (details in section 2) will be an integrated dashboard which allows users to perform different types of analysis while aiding them in making informed decisions in portfolio construction.\r\n3.0 Scope\r\nFinancial Asset Universe - The list of assets covered in our application is shown below:\r\nS/N\r\nStock Market Indices\r\nCommodities\r\nBonds\r\n1\r\nUS\r\nGold\r\nInvestment Grade\r\n2\r\nUK\r\nSilver\r\nHigh-Yield\r\n3\r\nGermany\r\nCopper\r\n\r\n4\r\nFrance\r\nIron\r\n\r\n5\r\nItaly\r\nNatural Gas\r\n\r\n6\r\nSpain\r\nCrude Oil\r\n\r\n7\r\nBrazil\r\n\r\n\r\n8\r\nSingapore\r\n\r\n\r\n9\r\nHong Kong\r\n\r\n\r\n10\r\nJapan\r\n\r\n\r\n11\r\nChina\r\n\r\n\r\n12\r\nAustralia\r\n\r\n\r\n13\r\nKorea\r\n\r\n\r\n14\r\nIndia\r\n\r\n\r\n4.0 Data\r\nThe data source of our project will be Bloomberg and all data will be extracted in a data-dump through Bloomberg terminal. The data extracted will be from Jan 1 2021 through to present day.\r\nThe main attributes extracted will be:\r\nOpen Price : The Stock at which opens at the start of market\r\nHigh price : The particular stock which made high during that particular day\r\nLow Price : The Particular stock which made Low during that particular day\r\nClose Price : The stock closing at the end of the Market hours\r\n5.0 Application Features\r\nThe main target audience for our application are prospective investors who are looking for a tool to help them build their portfolio and diversify their holdings. This section explores features of our application and some ways it can help our users. The application itself is split up into 3 main sections address different parts of the investing process.\r\n5.1 Exploratory Data Analysis (EDA)\r\nBase visualizations and analysis of key financial asset returns metrics\r\nExploratory Data Analysis (EDA) is an approach to analyzing data sets to summarize their main characteristics, often with visual methods. It will be useful for potential investors to have a visual tool to understand various key metrics when analysing financial assets. Some of the key metrics our application aims to help users visualize include:\r\nCorrelation\r\nCorrelation matrix to show correlation between selected assets at different time horizons\r\nDistribution of returns\r\nHistogram showing distribution of returns for different assets will allow users to visualize volatility\r\nRisk to Reward\r\nPurely looking at gross returns often does not paint the full picture as most high-returns assets come with greater volatility. Metrics such as Sharpe - Ratio will allow users to get a better sense of the Risk:Reward profile of different assets\r\nTechnical indicators\r\nTechnical analysis is a trading discipline employed to evaluate investments and identify trading opportunities by analyzing statistical trends gathered from trading activity, such as price movement and volume.\r\nOur application will categorize indicators based on their category (trend, momentum or volatility) so as to allow users to know precisely what the indicator is looking at. This is in contrast to many existing websites where users have a whole plethora of indicators at their disposal but not knowing what they are actually evaluating.\r\nPossible insights: Diversification through identifying weakly correlated markets and indices. This allows the user to ‘put their eggs across different baskets’ and spread out their risk.\r\n5.2 Time-Series Forecasting\r\nPredicting financial asset prices using an ARIMA model\r\nARIMA is an acronym that stands for AutoRegressive Integrated Moving Average. It is a class of model that captures a suite of different standard temporal structures in time series data.\r\nAR: Autoregression. A regression model that uses the dependencies between an observation and a number of lagged observations.\r\nI: Integrated. To make the time series stationary by measuring the differences of observations at different time.\r\nMA: Moving Average. An approach that takes into accounts the dependency between observations and the residual error terms when a moving average model is used to the lagged observations (q).\r\nAlong with various parameters to be tuned, an ARIMA model uses purely price action data for forecasting future prices.\r\nThe general form of an ARIMA model is denoted as ARIMA (p, q, d). With seasonal time series data, it is likely that short-run non-seasonal components contribute to the model. ARIMA model is typically represented as ARIMA (p, q, d), where: —\r\np is the number of lag observations utilized in training the model (i.e., lag order).\r\nd is the number of times differencing is applied (i.e. the degree of differencing).\r\nq is known as the size of the moving average window (i.e., order of moving average).\r\nPossible insights: Forecast what are the likely price movements in the period ahead in order to identify optimal entry points\r\n5.3 Time-Series Clustering\r\nClustering financial assets based on historical returns\r\nTime series clustering is to partition time series data into groups based on similarity or distance, so that time series in the same cluster are similar. Dynamic Time Warping (DTW) is used as the similarity/distance metric and finds optimal alignment between two time series.\r\nThe first step is to work out an appropriate distance/similarity metric (i.e. DTW).\r\nThe second step, use existing clustering techniques, such as k-means, hierarchical clustering, density-based clustering or subspace clustering, to find clustering structures.\r\nThe final result will then be presented on the visualization.\r\nPossible insights: Time series in the same cluster are likely to undergo similar cycles and risks.This means that users can expect similar movements across cycles/periods and act accordingly.\r\n6.0 Tools and Packages\r\nS/N\r\nPackage\r\nDocumentation\r\n1\r\ntidyverse\r\nhttps://www.tidyverse.org/\r\n2\r\ndplyr\r\nhttps://www.rdocumentation.org/packages/dplyr/versions/0.7.8\r\n3\r\nTTR\r\nhttps://cran.r-project.org/web/packages/TTR/index.html\r\n4\r\nplotly\r\nhttps://www.rdocumentation.org/packages/plotly/versions/4.9.3/topics/plot_ly\r\n5\r\nggplot2\r\nhttps://www.rdocumentation.org/packages/ggplot2/versions/3.3.3\r\n6\r\nShiny\r\nhttps://www.rdocumentation.org/packages/shiny/versions/1.6.0\r\n7\r\ndtwcluster\r\nhttps://www.rdocumentation.org/packages/dtwclust/versions/3.1.1\r\n8\r\ndygraphs\r\nhttps://www.rdocumentation.org/packages/dygraphs/versions/1.1.1.6\r\n9\r\ntidyquant\r\nhttps://cran.r-project.org/web/packages/tidyquant/index.html\r\n10\r\nreadr\r\nhttps://www.rdocumentation.org/packages/readr/versions/1.3.1\r\n11\r\nrticles\r\nhttps://www.rdocumentation.org/packages/rticles/versions/0.18\r\n7.0 References\r\nA benchmark study on time series clustering\r\nA Scalable Method for Time Series Clustering\r\nTechnical Analysis with R\r\nExamination of the profitability of technical analysis based on moving average strategies in BRICS\r\nStock Price Prediction Using the ARIMA Model\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-28T19:27:27+08:00",
    "input_file": "visual-analytics-project.utf8.md"
  },
  {
    "path": "posts/2021-02-09-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A makeover of the data visualisations on willingness of the public towards COVID-19 vaccinations in selected countries.",
    "author": [
      {
        "name": "Yi Heen, Boey",
        "url": "https://www.linkedin.com/in/yiheen-boey/"
      }
    ],
    "date": "2021-02-09",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1 - Critique the visualization1.1 Clarity\r\n1.2 Aesthetics\r\n\r\n2 - The suggested visualization\r\n3 - The Visualization process3.1 Data Preparation\r\n3.2 Steps taken for first Visualization\r\n3.2 Steps taken for second Visualization\r\n3.4 Adding Filters\r\n3.5 Creating the dashboard\r\n\r\n4 - The improved data visualization\r\n5 - New Insights5.1 Vaccine avoidance due to side effects\r\n5.2 Bigger familes have mixed views on vaccines\r\n5.3 Many are waiting before taking vaccine\r\n\r\n\r\n1 - Critique the visualization\r\n\r\n\r\n\r\nFigure 1: The Original Visualization (with Markups)\r\n\r\n\r\n\r\n1.1 Clarity\r\nS/N\r\nComments\r\nSuggested Improvements\r\nC1\r\nThe neutral values of the likert scale on the diverging stacked chart are not centred on zero. This makes it hard for the users to compare the ratings across different categories and also makes it hard to tell whether the responses were skewed towards agreement or disagreement.\r\nRedo the diverging stacked bar chart with the neutral values of the likert scale centred around zero.\r\nC2\r\nThe categories in the current chart is ordered alphabetically. This is not meaningful as there is no analytical findings nor message conveyed through unordered categories such as country names.\r\nSort the categories (rows) of the table by the proportion of a chosen response type and synchronize the order across both visualizations. This is important in order to compare the visualization across both charts.\r\nC3\r\nInformation is missing on how many respondents are there per country. This can be very valuable in providing a context to readers.\r\nAdd in the count of respondents from each country as a tooltip.\r\nC4\r\nThe respondents of each country is made up from different social strata. Each group can have different attitudes towards vaccination. By grouping them all by country, we run the risk of over-generalization.\r\nAdd in options for users to filter and slice the visualizations. This allows the user to glean more insight. e.g. comparing the willingness of respondents aged over 65 and unemployed in two different countries.\r\nC5\r\nThe second chart on the right shows the proportion of strongly agree responses as a point estimate. That can be misleading as there is often uncertainty associated with such survey data.\r\nChange the chart to a point estimate with error bars showing the confidence interval of the responses.\r\nC6\r\nThe survey consists of a lot of questions and the current visualization only shows the responses relating to one question. This undermines the usefulness of the survey.\r\nAdd in options to view the responses of other questions in the survey.\r\n1.2 Aesthetics\r\nS/N\r\nComments\r\nSuggested Improvements\r\nA1\r\nColours on the chart are randomised and do not follow a logical pattern.\r\nReplot the chart with colours on a red-blue spectrum. Red should be on one end of the spectrum to indicate ‘Strongly Disagree’ and Blue on the other end to indicate ‘Strongly Agree’\r\nA2\r\nScale of the diverging stacked bar chart starts at 0% and ends at 100%. This will not be sufficient to display the full range of responses gathered on vaccination opinions.\r\nAdjust scale of the bar and the values of the responses to allow for negative values. This will allow the negative opinions (4 and 5) that show disagreement to be accurately represented. It will also help to answer the question posed by the title:Which country is more pro-vaccine? i.e. Change from the responses from 1 to 5 to -2 to 2.\r\nA3\r\nLegend not properly named and labeled. While readers can infer the feedback when given by the two extreme values of ‘Strongly Agree’ and ‘Strongly Disagree’, it would be clearer to properly label each and every one of them.\r\nRename the legend and specifically label each and every one of the different colors on the diverging bar chart.\r\nA4\r\nClear titles on both charts\r\nFollow and recreate a similar aesthetic.\r\n2 - The suggested visualization\r\nThe proposed design is as follows.\r\n\r\n\r\n\r\nFigure 2: Sketching the Suggested Visualizations\r\n\r\n\r\n\r\n3 - The Visualization process\r\nThe Data Source used is from the Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub. The files can be found here.\r\n3.1 Data Preparation\r\nDownload all 14 required data files from github as CSV files\r\nLoad all 14 files into Tableau and study the file structure.\r\nJoin all 14 files in a union using Tableau\r\n\r\n\r\n\r\nFigure 3: Creating a union across all files.\r\n\r\n\r\n\r\nCreate aliases so that the values are country names instead of countrynames.csv\r\n\r\n\r\n\r\nFigure 4: Aliases for file names\r\n\r\n\r\n\r\nPull required fields into the rows and column shelves.\r\nRows : Table Name, RecordNo\r\ncolumns : disability, gender, House rooms, Household size, Employment Status, Household Children, Age, vac_1, vac_3, Vac2_1, vac2_2, vac2_3, vac2_6\r\n\r\nCreate a view of the data for export\r\n\r\n\r\n\r\nFigure 5: View data\r\n\r\n\r\n\r\nExport ALL data to a compiled file\r\n\r\n\r\n\r\nFigure 6: Exporting a compiled file\r\n\r\n\r\n\r\n8a. In excel replace values for in the fields ‘vac_1’, ‘vac_3’, ‘Vac2_1’, ‘vac2_2’, ‘vac2_3’, ‘vac2_6’. - ‘1 - Strongly Agree’ with ‘2’ - ‘2’ with ‘1’ - ‘3’ with ‘0’ - ‘4’ with ‘-1’ - ‘5 - Strongly Disagree’ with ‘-2’\r\n\r\n\r\n\r\nFigure 7: Replacing values in excel\r\n\r\n\r\n\r\n8b. This step can also be done by using aliases in Tableau. But a set of aliases will need to be created for each of the fields.\r\n\r\n\r\n\r\nFigure 8: Replacing values in Tableau\r\n\r\n\r\n\r\nChange the data type for All vac columns to whole numbers\r\n\r\n\r\n\r\nFigure 9: Changing data types\r\n\r\n\r\n\r\nRename the field “Table Name” to “Country”\r\n\r\n\r\n\r\nFigure 10: Renaming to Country\r\n\r\n\r\n\r\n3.2 Steps taken for first Visualization\r\nCreate a new parameter showing the different questions given to the survey respondents. Match each of ‘vac_1’, ‘vac_3’, ‘vac2_1’, ‘vac2_2’, ‘vac2_3’, ‘vac2_6’ to their respective questions.\r\nExpose the parameter by checking the ‘Show Parameter’ option.\r\n\r\n\r\n\r\nFigure 11: Creating a new parameter for the survey questions\r\n\r\n\r\n\r\nNext, create a calculated field ‘Selected’\r\n\r\n\r\n\r\nFigure 12: Creating a calculated field - Selected\r\n\r\n\r\n\r\nNext, create a calculated field ‘Number of Records’\r\n\r\n\r\n\r\nFigure 13: Creating a calculated field - Number of Records\r\n\r\n\r\n\r\nNext, create a calculated field ‘Total Count’\r\n\r\n\r\n\r\nFigure 14: Creating a calculated field - Total Count\r\n\r\n\r\n\r\nNext, create a calculated field ‘Count Negative’\r\n\r\n\r\n\r\nFigure 15: Creating a calculated field - Count Negative\r\n\r\n\r\n\r\nNext, create a calculated field ‘Gantt Percent’\r\n\r\n\r\n\r\nFigure 16: Creating a calculated field - Gantt Percent\r\n\r\n\r\n\r\nNext, create a calculated field ‘Percentage’\r\n\r\n\r\n\r\nFigure 17: Creating a calculated field - Percentage\r\n\r\n\r\n\r\nDrag ‘Gantt Percent’ and ‘Country’ in the columns and rows shelves respectively\r\n\r\n\r\n\r\nFigure 18: Populating the columns and rows\r\n\r\n\r\n\r\nDrag following fields into the marks card.\r\n‘Selected’ to colour and change to Discrete Dimension\r\n‘Percentage’ to size\r\n‘Total Count’ to tooltip and change to Discrete\r\n‘Selected’ to Detail and change to Discrete Dimension\r\n\r\nchange the mark type from automatic to Gantt Bar\r\n\r\n\r\n\r\nFigure 19: Populating the Marks card\r\n\r\n\r\n\r\nChange both ‘Percentage’ and ‘Gantt Percentage’ to compute using ‘Selected’\r\n\r\n\r\n\r\nFigure 20: Changing the computation methods\r\n\r\n\r\n\r\nFilter away null responses in ‘Selected’\r\n\r\n\r\n\r\nFigure 21: Filtering nulls\r\n\r\n\r\n\r\nRename legend from ‘Selected’ to ‘Responses’ and assign a more logical colour scheme\r\n\r\n\r\n\r\nFigure 22: Formatting the legend\r\n\r\n\r\n\r\nCreate aliases for the numbered responses\r\n‘-2’ to ‘Strongly Disagree’\r\n‘-1’ to ‘Disagree’\r\n‘0’ to ‘Neither Agree nor Disagree’\r\n‘1’ to ‘Agree’\r\n‘2’ to ‘Strongly Agree’\r\n\r\n\r\n\r\n\r\nFigure 23: Creating Aliases for the responses\r\n\r\n\r\n\r\n3.2 Steps taken for second Visualization\r\nCreate a new parameter showing the response types given by the survey respondents. Match each of the numerical values to the responses given. Expose parameter by clicking on the Show parameter option.\r\n\r\n\r\n\r\nFigure 24: Creating a new parameter for the survey responses\r\n\r\n\r\n\r\nCreate calculated fields needed for 95% confidence interval. For starters - Create Z-Value for 95% confidence interval, ‘Z_95%’\r\n\r\n\r\n\r\nFigure 25: Creating a calculated field - 95% Z value\r\n\r\n\r\n\r\n28.Next, create a calculated field ‘Count Response Type’ which counts the number of response of the selected response type given by the parameter ‘Response Type’\r\n\r\n\r\n\r\nFigure 26: Creating a calculated field - Count Response Type\r\n\r\n\r\n\r\nNext, create a calculated field ‘Prop’: proportion of response type compared to all the responses received\r\n\r\n\r\n\r\nFigure 27: Creating a calculated field - Prop\r\n\r\n\r\n\r\nNext, create a calculated field ‘Prop_SE’ standard error of the proportion\r\n\r\n\r\n\r\nFigure 28: Creating a calculated field - Prop_SE\r\n\r\n\r\n\r\nNext, create two calculated fields ‘Prop_Lower Limit 95%’ and ‘Prop_Upper Limit 95%’ to construct the error bars\r\n\r\n\r\n\r\nFigure 29: Creating a calculated field - Prop_Lower Limit 95%, Prop_Upper Limit 95%\r\n\r\n\r\n\r\nDrag ‘Country’ and ‘Prop’ onto the canvas to create a table.\r\n\r\n\r\n\r\nFigure 30: Creating a table with Country and Prop\r\n\r\n\r\n\r\nChange mark type to circle\r\n\r\n\r\n\r\nFigure 31: Changing mark type to circles\r\n\r\n\r\n\r\nDrag all ‘Measure Values’ into the Marks Card\r\n\r\n\r\n\r\nFigure 32: Moving Measure Values into Marks\r\n\r\n\r\n\r\nDrop all other ‘Measure Values’ from the Marks Card except ‘Prop_Lower Limit 95%’ and ‘Prop_Upper Limit 95%’\r\n\r\n\r\n\r\nFigure 33: Moving Measure Values into Marks\r\n\r\n\r\n\r\nDrag ‘Measure Values’ to columns shelf.\r\n\r\n\r\n\r\nFigure 34: Moving Measure Values into columns\r\n\r\n\r\n\r\nChange resulting charts into Dual Axis\r\nSynchronize both axes\r\n\r\n\r\n\r\nFigure 35: Creating a Dual Axis chartt\r\n\r\n\r\n\r\nChange Mark Type to line\r\n\r\n\r\n\r\nFigure 36: Changing Mark type to line\r\n\r\n\r\n\r\nDrag ‘Measure Names’ into both colour and Path for the Measure Values Card\r\n\r\n\r\n\r\nFigure 37: Using Measure Names on Colour and Path\r\n\r\n\r\n\r\nSelect colours for error bar and circle\r\n\r\n\r\n\r\nFigure 38: Colouring the error bars chart\r\n\r\n\r\n\r\nCompleted view of second visualization\r\n\r\n\r\n\r\nFigure 39: Proportions with Error Bars\r\n\r\n\r\n\r\n3.4 Adding Filters\r\nCreate a calculated field ‘Age Groups’ by binning the age of respondents into bins of 10 years.\r\n\r\n\r\n\r\nFigure 40: Creating Calculated Field - Age Groups\r\n\r\n\r\n\r\nCreate a calculated field ‘Household Children (Groups)’ by binning the age of respondents into bins of size 2.\r\n\r\n\r\n\r\nFigure 41: Creating Calculated Field - Household Children (Groups)\r\n\r\n\r\n\r\nCreate a calculated field ‘Household Size (Groups)’ by binning the age of respondents into bins of size 3.\r\n\r\n\r\n\r\nFigure 42: Creating Calculated Field - Household Size (Groups)\r\n\r\n\r\n\r\nAdd all of the following fields to the filters card:\r\n‘Age Groups’\r\n‘Household Children (Groups)’\r\n‘Household Size (Groups)’\r\n‘Employment Status’\r\n‘Gender’\r\n\r\n\r\n\r\n\r\nFigure 43: Creating Calculated Field - Household Size (Groups)\r\n\r\n\r\n\r\nFor all filters, select option to ‘All using related data sources’ to allow filtering across different visuals\r\n\r\n\r\n\r\nFigure 44: Creating Calculated Field - Household Size (Groups)\r\n\r\n\r\n\r\n3.5 Creating the dashboard\r\nFor both the visualizations change the sort order to sort by ‘Prop’ so that the sorts will synch for both charts.\r\n\r\n\r\n\r\nFigure 45: Changing Sort Orders for both charts\r\n\r\n\r\n\r\nCreate a new sheet to create a title for the dashboard. This is not done on each individual worksheet because it will otherwise repeat the lengthy question. This allows the selected question to show up on the dashboard title. The title will be “Question: <Parameters.Survey Question>”\r\n\r\n\r\n\r\nFigure 46: Creating a title for the dashboard\r\n\r\n\r\n\r\nChange title of first visualization to “Survey Responses by Country”\r\n\r\n\r\n\r\nFigure 47: Renaming first visualization\r\n\r\n\r\n\r\nChange title of second visualization to “Proportion <Parameters.Response Type> to:”\r\n\r\n\r\n\r\nFigure 48: Renaming second visualization\r\n\r\n\r\n\r\nChange the size of the dashboad to automatic. This is needed as the dashboard is expected to be wider and this will allow the dashboard to accomodate the two visualizations side by side. The wider visualizations will also show the proportions and error bar more clearly.\r\n\r\n\r\n\r\nFigure 49: Changing size of dashboard to automatic\r\n\r\n\r\n\r\nDrag the main elements of the dashboard into a side by side arrangement\r\n\r\n\r\n\r\nFigure 50: Initial layout of dashboard\r\n\r\n\r\n\r\nAdd Reference line at 0 to the diverging bar plot\r\n\r\n\r\n\r\nFigure 51: Adding reference line at 0\r\n\r\n\r\n\r\nRemove country names from the first visualization as both the visualizations will have the same sort order and can share the labels in the middle.\r\n\r\n\r\n\r\nFigure 52: Removing Country Names for more Space\r\n\r\n\r\n\r\nRearrange filters neatly.\r\nAdd in reference to data source.\r\nTurn on animations for smoother transitions while filtering\r\nDashboard is complete.\r\n4 - The improved data visualization\r\nThe completed visualization is as follows.\r\n\r\n\r\n\r\nFigure 53: Snapshot of the completed dashboard\r\n\r\n\r\n\r\nThe interactive dashboard is uploaded onto Tableau Public Server and can be found here.\r\n5 - New Insights\r\n5.1 Vaccine avoidance due to side effects\r\nUsing the orange boxes - In the survey question: “If a Covid-19 Vaccine were made available to me this week, I would definitely get it.” We can see that a large proportion of the French respondents disagreed strongly (ranked 1st when sorting by proportion ‘Strongly Disagree’). When comparing this against the results of the question: “I am worried about the potential side effects of a Covid-19 vaccine.” The French respondents ranked top by proportion of ‘Strongly Agree’ responses.\r\nConversely, using the green boxes, we can see the countries of Netherlands and United Kingdom having correspondingly high levels of vaccine acceptance and low levels of worries about side-effects.\r\n\r\n\r\n\r\nFigure 54: Resistance to vaccine could come from fear\r\n\r\n\r\n\r\n5.2 Bigger familes have mixed views on vaccines\r\nOn the same survey question: “If a Covid-19 Vaccine were made available to me this week, I would definitely get it.” You can see a huge standard error in the proportion of ‘Strongly Agree’ responses. This could be due to a couple of reasons. The first could be due to the actual divergence in views in large families. The second is could be due to a smaller sample size, which is the case. (Most of the survey respondents had family sizes of 1-3).\r\nA takeaway on this is to view the data as a whole without filtering on household size unless the number of survey responses from larger households can be collected.\r\n\r\n\r\n\r\nFigure 55: Increased SE in bigger families\r\n\r\n\r\n\r\n5.3 Many are waiting before taking vaccine\r\nFollowing the same line of thought from the previous insight. Vaccine worries tend to ease off with time with better research and testing. The general attitude towards vaccine warms up considerably when vaccines were to be made available in one year instead of one week. This can be seen in lower number of disagreeing responses across the board (orange boxes) and higher number of strongly agree across all countries (green boxes).\r\nA takeaway for the authorities could be that while aggressively ramping up vaccination capacity, they need to work on converting opinions on vaccine safety as well. Ambitious targets to vaccinate whole populations in months could be futile if the population is resistant towards taking the vaccines.\r\n\r\n\r\n\r\nFigure 56: Vaccine opinions improve over time\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-09-dataviz-makeover-2/final.png",
    "last_modified": "2021-02-18T22:16:09+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-26-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A makeover of the data visualisation on Resident Labour Force in Singapore.",
    "author": [
      {
        "name": "Yi Heen, Boey",
        "url": "https://www.linkedin.com/in/yiheen-boey/"
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1 - Critique the visualization\r\n2 - A sketch of the improved visualization\r\n3 - The improved data visualization\r\n4 - The data preparation process\r\n5 - New insights\r\n\r\n1 - Critique the visualization\r\nIdentify at least three from each evaluation criterion (Clarity and aesthetics)\r\n\r\n\r\n\r\nFigure 1: The original data visualization\r\n\r\n\r\n\r\n1.1 Clarity\r\n1.1.1 Unclear title\r\nThe title “Resident Labour Force by Age” was used for the visualization. This is unclear and does not inform the reader quickly what the visualization is depicting which is the comparison of labour force by age groups between 2009 and 2019.\r\nSuggestion - Change title\r\nUse the title “Resident Labour Force in Singapore by Age Groups, June of of 2009 & 2019”\r\n1.1.2 Wrong visualization used for the given datatype\r\nAge groups are a categorical datatype. The line graph being used currently is better suited for continuous datatypes.\r\nSuggestion - Change Visualization Type\r\nSwitch to using a bar graph instead of a line graph.\r\nEnsure Vertical Axis starts at zero\r\n1.1.3 Plotting a median line on categorical scale\r\nData has already been binned into age groups. There is no way of calculating a discrete median age like 41. If there is a median, it should be the age group of 40-44. i.e. Both groups will have the same median.\r\nSuggestion - Remove the median lines\r\nMark the bars for 40-44 with a label to show that the median falls within that category.\r\n1.1.4 Percentages can omit context\r\nUsing percentages like the Labour force participation rate can omit important contextual information like the true number of people in each age group.\r\nSuggestion - Plot the bar graph with actual numbers instead of percentages\r\nBar graphs should be sufficient to show the differences in proportions across different categories\r\n1.1.5 Unclear description of percentages points\r\nWhen comparing percentages across different groups and time periods, the term to be used should be percentage points. While the write up does not use the words percentage change, it can be ambiguous.\r\nSuggestion - Clarify the changes in percentages.\r\nPoints being made on changes in percentages such as “Declined from 75% to 67%” can be rewritten as “Declined 8 percentage points from 75% to 67%”.\r\n1.1.6 Write up not aligned with visualization\r\nThe opening line of the write up refers to LFPR (Labour Force Participation Rate) whereas the visualization depicts the proportion of labour force. There is no data visualization that readers can refer to while reading statements related to LFPR.The percentages for labour force between 25 and 54 are also not clearly shown.\r\nSuggestion - Include a more visualizations on Labour Force Participation and proportion of labour force.\r\nUse Table 5 on labour force and Table 7 on participation rates to get numbers by age group for labour force participation. Together, the graphs will give a clearer idea of how much labour force participation there is with respect to the resident labour force size. The added visuals will also give view on what is the proportion of resident labour force across age groups.\r\n1.2 Aesthetics\r\n1.2.1 Missing vertical axis and gridlines\r\nVertical axis is missing, and gridlines are not present on the vertical axis. This can make comparison across different age groups difficult. The units for the vertical axis “Per Cent” is put under the title as well.\r\nSuggestion - Add in missing elements\r\nVertical axis should be added to the visualization\r\nGridlines and tick marks on the vertical axis should be added\r\nLabel Vertical axis title as “Resident Labour Force (‘000s)”\r\n1.2.2 Good use of Colours\r\nGood consistent (e.g. lines, labels, data table) use of colours to differentiate between 2009 and 2019.\r\nSuggestion - Follow and recreate a similar aesthetic.\r\nEnsure colours and format are replicated across both graphs.\r\n1.2.3 Good use of space and colouring\r\nFollowing on from point S2, the colours have already well marked out the datapoints and features relating to 2009 and 2019. It would be superfluous to add in a legend.\r\nSuggestion - Follow and recreate a similar aesthetic.\r\nSwitching to a grouped bar chart would mean that colors will be important for readers to tell the different categories apart because we will not be able to label the lines the way the original visualization did. Ensure that a legend is included and consistent across both charts.\r\n1.2.4 Missing horizontal axis label\r\nHorizontal axis label is missing. Although it can be inferred based on the categories and the title of the visualization. It would be better if the axis is clearly labelled.\r\nSuggestion - Add in missing elements\r\nLabel horizontal axis title as “Age Groups”\r\nGridlines and tick marks will not be needed as visualization will be changed to a bar graph.\r\n2 - A sketch of the improved visualization\r\nWith reference to the critics above, suggest alternative graphical presentation to improve the current design. The proposed alternative data visualisation must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design tries to overcome.\r\n\r\n\r\n\r\nFigure 2: A sketch of the suggested visualizatons\r\n\r\n\r\n\r\n3 - The improved data visualization\r\nMore Older Residents in the Workforce\r\nWith population ageing and sustained rise in LFPR of older residents, the share of residents aged 55 & over in the labour force rose 9 percentage points from 16% in 2009 to 25% in 2019. Meanwhile, the share of the resident labour force aged 24 to 54 declined 8 percentage points from 75% to 67% even as their LFPR increased, as the population cohorts moving into these age bands were smaller than those who moved out due to lower birth rates. While the median age of residents in the labour force stayed in the 40-44 year old age group from 2009 to 2019, it is likely that the median age will soon shift up to the 45-49 year old age group as the population ages further.\r\n\r\n\r\n\r\nFigure 3: The improved data visualization\r\n\r\n\r\n\r\nThe link to the original dashboard on Tableau Public Server can be found here.\r\n4 - The data preparation process\r\nProvide step-by-step description on how the data visualization was prepared.\r\n4.1 Data Sources Used:\r\nRESIDENT LABOUR FORCE AGED FIFTEEN YEARS AND OVER BY AGE AND SEX, 2009 - 2019 (JUNE) - Table 7\r\nRESIDENT LABOUR FORCE PARTICIPATION RATE BY AGE AND SEX, 2009 - 2019 (JUNE) - TABLE 5\r\n4.2 Steps taken for first Visualization\r\n\r\nFigure 4: Original (TOTAL) Dataset in table 7\r\nUsing the (TOTAL) sheet in table 7 (mrsd_2019LabourForce_T7.xlsx), select and preserve only the required data. i.e. Age groups, 2009 and 2019. Delete all other rows (including the total row) and columns (and blank columns).\r\nRename “Age (Years)” to “Age Groups”\r\nRemove whitespaces in data. e.g. “15 - 19” to “15-19” and “70 and over” to “>=70” to maximise use of space.\r\n\r\nFigure 5: Remaining Dataset after trimming\r\nSave the excel file,create a new Tableau workbook and load the file (mrsd_2019LabourForce_T7.xlsx) into Tableau. Ensure that the datasheet (T7_T) is loaded correctly and the datatypes are correctly identifed by tableau.\r\n\r\nFigure 6: Data Imported into Tableau and their datatypes\r\nSwitch to Sheet 1 and rename it “Visual 1” in Tableau\r\nDrag Age Groups into columns and 2009 / 2019 into rows as seen in the screenshot below.\r\n\r\nFigure 7: Dragging fields into rows and columns\r\nDrag the values for 2019 on the same vertical axis where the 2009 values are plotted.\r\n\r\nFigure 8: Plotting the data for 2009 and 2019 on the same axes\r\nDrag measure names onto color in order to add color to the grouped bar chart. The bars are now color coded by year.\r\n\r\nFigure 9: Getting your bar chart color coded by year\r\nHide the headers showing 2009 and 2019 at the bottom of the bar chart as they are no longer necessary.\r\nRename vertical axis and include units: “Resident Labour Force (’000s)”\r\nAdd in an annotation to indicate the median group which is 40-44 for both 2009 and 2019.\r\nRename visualization to: “Resident Labour Force by Age Groups, June of 2009 & 2019”\r\n\r\nFigure 10: Adding finishing touches and labels\r\nRename the title of the legend from Measure Names to Year\r\n\r\nFigure 11: Renaming the legend\r\nFinally, set the axis range to be from 0 to 300 so that sizes of the bars can be compared across both visualizations.\r\n\r\nFigure 12: Making the bar charts of similar size scales\r\n4.3 Steps taken for second Visualization\r\n\r\nFigure 13: Original Dataset in table 5\r\nSimilarly, using the (TOTAL) sheet in table 5 (mrsd_2019LabourForce_T5.xlsx), select and preserve only the required data. i.e. Age groups, 2009 and 2019. Delete all other rows (including the total row) and columns (and blank columns).\r\nRename “Age (Years)” to “Age Groups”\r\nRemove whitespaces in data. e.g. “15 - 19” to “15-19” and “70 and over” to “>=70” to maximise use of space.\r\n\r\nFigure 14: Remaining Dataset of labour force participation rates (%) after trimming\r\nSave the excel file and load it (mrsd_2019LabourForce_T5.xlsx) into the same Tableau workbook. Drag the new required datasource (T5_T) into use.\r\nEnsure that the datasheet (T5-T) is loaded correctly and the datatypes are correctly identifed by tableau.Also ensure that the relationship between T5_T and T7_T is correctly identifed. i.e. Using the Age Group columns in both datasets to create a relationship.\r\n\r\nFigure 15: Importing T5_T into the same Tableau Workbook and creating a relationship\r\nCreate a new sheet in the Tableau workbook and rename it “Visual 2”.\r\nFrom the data fields available. Create two new calculated fields to find the number of participants in the labour force in each year. Name them as “2009 Labour Force Participants” and “2019 Labour Force Participants”. The equation is shown below.\r\n\\[Resident Labour Force * Labour Force Participation Rate / 100\\]\r\n\r\nFigure 16: Using calculated fields to find the actual number of people participating in the labour force\r\nDrag Age Groups into columns and 2009 Labour Force Participants / 2019 Labour Force Participants into rows as seen in the screenshot below.\r\n\r\nFigure 17: Dragging fields into rows and columns\r\nDrag the values for 2019 Labour Force Participants on the same vertical axis where the 2009 Labour Force Participants values are plotted.\r\n\r\nFigure 18: Plotting the data for 2009 and 2019 on the same axes\r\nDrag measure names onto color in order to add color to the grouped bar chart. The bars are now color coded by year.\r\nEnsure that the colors are consistent with visual 1. Blue for 2009 and Orange for 2019.\r\n\r\nFigure 19: Keeping colors consistent across visuals will make cross referencing intuitive\r\nHide the headers showing 2009 Labour Force Participants and 2019 Labour Force Participants at the bottom of the bar chart as they are no longer necessary.\r\nRename vertical axis and include units: “Labour Force Participants (’000s)”\r\nRename visualization to: “Labour Force Participants by Age Groups, June of 2009 & 2019”\r\nFinally, set the axis range to be from 0 to 300 so that sizes of the bars can be compared across both visualizations.\r\n\r\nFigure 20: Making the bar charts of similar size scales\r\n4.4 Steps taken for third visualization\r\nCreate a new sheet in the Tableau workbook and rename it “Visual 3”.\r\nDrag Age Groups into rows and resident labour force size 2009 from T7_T into Text\r\n\r\nFigure 21: Creating a data table with resident labour force size\r\nChange the values of 2009 labour force size into a quick table calculation as Percentage of Total\r\n\r\nFigure 22: Converting data table to percentages of total\r\nGroup the values for 25-29,30-34,35-39,40-44,45-49,50-54 together\r\n\r\nFigure 23: Grouping data together to align with the writeup\r\nEdit the group name to be 25-54\r\n\r\nFigure 24: Renaming the grouped data\r\nChange visual into a Highlight Table. Select Range of highlight color to be blue for 2009, aligned with the rest of the visuals.Rename column header to age group.\r\n\r\nFigure 25: Renaming the grouped data\r\nRename visual to Labour Force Proportion 2009\r\nRedo all the steps to create a fourth visual for proportion of resident labour force in 2019 and using orange as the colour for the highlight table.\r\n4.5 Pulling it all into a dashboard\r\nCreate a new dashboard and name it “Singapore Resident Labour Force and Participants 2009 vs 2019”\r\nDrag Visual 1 and Visual 2 onto the dashboard canvas in a top and bottom layout.\r\nReduce font size of chart titles to 10 to give more screen space to the charts.\r\n\r\nFigure 26: Initial Layout of the dashboard with reduced title font sizes\r\nRemove one of the legends from the dashboard as the legend is designed to be consistent across both charts.\r\n\r\nFigure 27: Removing a redundant legend\r\nUpdate the title of the respective charts to\r\n“Resident Labour Force in Singapore by Age Groups, June of of 2009 & 2019”\r\n“Labour Force Participants in Singapore by Age Groups, June of 2009 & 2019”\r\nPull in Visuals 3 and Visuals 4 to fill in the whitespace near the legend and shift the legend downwards\r\n\r\nFigure 28: Pulling in the visual on proportions\r\nPublish to Tableau Public Server\r\n5 - New insights\r\nDescribe three major observations revealed by the data visualisation prepared.\r\n5.1 25-54 year olds are the most active in the labour force\r\nWorkforce participation for 25 to 54 year olds is the highest and consistently above 80%. These groups form the biggest part of the residential workforce and also participate the most. This is important for Singapore’s economy as its biggest group of workers are consistently and actively participating in positive economic activity. This is also something to be concerned about, as this group of workers age, their workforce participation is likely to mirror that of the current older age groups. If this group of residents (the largest group) turn older and stop partcipating, it will have grave consequences for Singapore’s economy and signals the need for rejuvenation.\r\n\r\nFigure 29: The biggest group of workers participate actively in the workforce\r\n5.2 Workforce participation changes significantly from 65\r\nThe workforce participants in each age group usually account for the majority of resident workforce (i.e. >50% as seen by the orange arrows). This is true until the age group of 65-69 (as marked out by the blue arrows). From here on, the work force participation drops significantly and goes below 50%. This is in line with what we can expect from Singapore’s offcial retirement age, currently set at 67 years old. With the retirement age expected to be raised till 70 years old in by 2030, the workforce participation picture is likely to change significantly from what we are seeing now.\r\n\r\nFigure 30: Workforce participation drops significantly after 65 years old.\r\n5.3 Insufficient young workers to replace old workers\r\nAs can be clearly seen, large numbers of the workforce are growing old and retiring from the workforce. This means that a younger generation has to take over. The numbers of younger workers (15-24 year olds) have been stagnating from 2009 to 2019. This is to be expected from the low birth rates seen in Singapore, which also explains the need for influx of foreign workers to supplant the requirements of the economy.\r\n\r\nFigure 31: Stagnating growth in young residential workforce and participation\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-26-dataviz-makeover-1/completed.png",
    "last_modified": "2021-02-28T16:10:05+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/2021-01-16-my-first-post/",
    "title": "My First Post",
    "description": "A trial of git and netlify.",
    "author": [
      {
        "name": "Yi Heen, Boey",
        "url": "https://www.linkedin.com/in/yiheen-boey/"
      }
    ],
    "date": "2021-01-16",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-16-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-26T21:53:23+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Hi there!",
    "description": "Welcome to my data visualization blog. I hope you enjoy \nreading what I share and any insights gleaned from this blog.",
    "author": [
      {
        "name": "Yi Heen, Boey",
        "url": "https://www.linkedin.com/in/yiheen-boey/"
      }
    ],
    "date": "2021-01-11",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T22:04:37+08:00",
    "input_file": {}
  }
]
